%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% GRAMATICA - JABIL INVOICE - HEBREW MAPPING FORMAT PROVIDED BY TAULIA
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

i_version( amat_jabil_hebrewsample, `02 September 2020` ).
%	The name must NOT contain a space, and must start with a lowercase letter
%	Conventionally we use the date to keep track of when it was last updated
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Created by Georgi Yotsov on 01.09.2020
%=======================================================================
% i_date_format( _ ).		%	Date Catch all - for american addresses this is often specified
i_date_format( `d/m/y` ).
%=======================================================================
i_format_postcode( X, X ).	%	Necessary to prevent the post/zip code from splitting in the output
%=======================================================================
i_op_param( us_invoice, _, _, _, false ).	%	To prevent assignment of line level VAT (sometimes shouldn't be present for Canadian invoices )
%=======================================================================
i_op_param( suppress_output_of_zero_value_lines, _, _, _, true) .
% json_custom_field( `invoiceOrigin`, `1` ).	%	For RedBull

%-----------------------------------------------------------------------
%	Capture Requirements
%-----------------------------------------------------------------------
%
%	Registration numbers
%	Invoice Number
%	Invoice Date
%	Order Number - If applicable
%	Totals (Net, VAT, Gross - need at least 2 out of 3 )
%	Line level Data
%
%-----------------------------------------------------------------------

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
i_rule_list( [
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

	 get_buyer_and_supplier_codes

	, invoice_or_credit_note_rule
	
	, get_invoice_totals

	, get_invoice_number
	
	, get_ponumber

	, get_invoice_date
	
	, get_invoice_lines

	%	Needed for CloudTrade Portal
	, sender_name( `Jabil Circuit Hungary Ltd` )

] ).
	

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% BUYER & SUPPLIER CODES
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	Populates the value appropriately
%=======================================================================

%=======================================================================
i_rule( get_buyer_and_supplier_codes, [ 
%=======================================================================
	
	supplier_registration_number( FROM )
	
	, buyer_registration_number( TO ) 
	
] ):- i_mail( from, FROM ), i_mail( to, TO ).

	
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% INVOICE OR CREDIT NOTE
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	Identification of Credit Notes
%=======================================================================

%=======================================================================
i_rule_cut( invoice_or_credit_note_rule, [
%=======================================================================

	or( [ 
	
		[ 
	
			q(0,10,line)

			, invoice_or_credit_note_line
		
			,  set(credit_note), trace( [ `this is a credit note` ] )
			%	Setting this flag alters the output routine and allows us to perform specific capture
		
		]
		
		, [
		
			trace( [ `This is an invoice` ] )
			
		]
		
	] )

] ).

%=======================================================================
i_line_rule_cut( invoice_or_credit_note_line, [ 
%=======================================================================

	q0n(anything), `Credit`, `Memo` 
	
] ).


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% INVOICE NUMBER
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	Invoice Number Capture
%=======================================================================

%=======================================================================
i_rule( get_invoice_number, [ 
%=======================================================================
	
	line_with_text(`הדועתרפסמ`)
	
	% , generic_horizontal_details( [ [ `Invoice`, `number`	], 100, invoice_number, s1, or( [ tab, newline ] ) ] )
	
	%, generic_vertical_details( [ [ `Invoice`, `Number` ], `Invoice`, q(0,0,line), (end, 20,20), invoice_number, s1, or( [ tab, newline ] ) ] )
	
	, line_invoice_number

] ).

%=======================================================================
i_line_rule( line_invoice_number, [ 
%=======================================================================
	
	generic_item( [ invoice_number, s, `:` ] ), q10(tab)
	
	, `הדועת`, `רפסמ`, gen_eof
	
	, q10( [
	
			test(credit_note)
			
			, check( invoice_number = OriginalInvoiceNumber )
			
			, original_invoice_number(OriginalInvoiceNumber)
	
	] )

] ).


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% PO NUMBER
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	PO Number Capture
%=======================================================================

%=======================================================================
i_rule( get_ponumber, [ 
%=======================================================================
	
	q(0,90,line)
	
	% , generic_horizontal_details( [ [ `PO`, `number`	], 100, order_number, s1, or( [ tab, newline ] ) ] )
	
	%, generic_vertical_details( [ [ `PO`, `number` ], `PO`, q(0,0,line), (end, 20,20), order_number, s1, or( [ tab, newline ] ) ] )
	
	, line_ponumber

] ).

%=======================================================================
i_line_rule( line_ponumber, [ 
%=======================================================================
	
	q0n(anything)
	
	, `PO`
	
	, generic_item( [ order_number, [ begin, q(dec,8,12), end ], or( [ tab, newline ] ) ] )

] ).


%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% INVOICE DATE
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	Invoice Date Capture
%=======================================================================

%=======================================================================
i_rule( get_invoice_date, [ 
%=======================================================================
	
	line_with_text(`תינובשחךיראת`)
	
	% , generic_horizontal_details( [ [ `Invoice`, `date` ], 100, invoice_date, date, or( [ tab, newline ] ) ] )
	
	%, generic_vertical_details( [ [ `Invoice`, `date` ], `Invoice`, q(0,0,line), (end, 20,20), invoice_date, date, or( [ tab, newline ] ) ] )
	
	, line_invoice_date

] ).

%=======================================================================
i_line_rule( line_invoice_date, [ 
%=======================================================================
	
	generic_item( [ invoice_date, date, q10(tab) ] ), `:`
	
	, `תינובשח`, `ךיראת`, gen_eof

] ).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% GET TOTALS
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	Invoice Totals Capture
%=======================================================================

%=======================================================================
i_rule( get_invoice_totals, [
%=======================================================================

	line_with_text(`ללוכריחמ`)
	
	, line_total_net
	
	, line_total_vat
	
	, line_default_vat_rate
	
	, q(0,1,line)
	
	, line_total_invoice
	
	%	Calculation if the VAT (tax) is missing
	, q10( [ 
	
		without( total_vat )
		
		, check( sys_calculate_str_subtract( total_invoice, total_net, VAT ) )
		
		, total_vat( VAT )
		
	] )
	
] ).

%=======================================================================
i_line_rule( line_total_net, [ 
%=======================================================================
	
	q10(`-`)
	
	, generic_item( [ total_net, d, tab ] )
	
	, `ללוכ`, `ריחמ`, gen_eof

] ).

%=======================================================================
i_line_rule( line_total_vat, [ 
%=======================================================================
	
	q10(`-`)
	
	, generic_item( [ total_vat, d, gen_eof ] )

] ).

%=======================================================================
i_line_rule( line_default_vat_rate, [ 
%=======================================================================
	
	`(`
	
	, generic_item( [ default_vat_rate, d, `%` ] ), `)`
	
	, `מ`, `"`, `עמ`, gen_eof

] ).

%=======================================================================
i_line_rule( line_total_invoice, [ 
%=======================================================================
	
	`ח`, `'`, `ש`, q10( [ `-`, set(credit_note) ] )
	
	, generic_item( [ total_invoice, d, tab ] )
	
	, `ריחמ`, `כ`, `"`, `הס`, gen_eof
	
] ).

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% GET LINES
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%	Line Level capture
%=======================================================================

%=======================================================================
i_section( get_invoice_lines, [
%=======================================================================

	line_header_line

	, q0n(

		or( [ 
		
			line_invoice_line
		
			%, line_continuation_line

			, line

		] )

	), line_end_line

] ).

%=======================================================================
i_line_rule_cut( line_header_line, [ 
%=======================================================================

	`ריחמ`, `כ`, `"`, `הס`, tab, `הדיחיל`, `ריחמ`, tab
	
] ).

%=======================================================================
i_line_rule_cut( line_end_line, [
%=======================================================================

	q0n(anything)
	
	, `ללוכ`, `ריחמ`, gen_eof
	
] ).

%=======================================================================
i_line_rule( line_continuation_line, [ 
%=======================================================================

	generic_append( [ line_descr, s1, newline, ` `,`` ] )  
	
] ).

%=======================================================================
i_line_rule_cut( line_invoice_line, [
%=======================================================================

	q10(`-`)
	
	, generic_item( [ line_net_amount, d, tab ] )
	
	, `ח`, `'`, `ש`
	
	, generic_item( [ line_unit_amount, d, tab ] )
	
	, `ע`, `'`, `ש`
	
	, q10(`-`)
	
	, generic_item( [ line_quantity, d, tab ] )
	
	, generic_item( [ line_descr, s1, tab ] )
	
	, generic_item( [ dumym_item, s1, newline ] )

] ).
